[
  {
    "id": 1,
    "title": "Adidas Shoes",
    "image": "../../assets/shoes1.png",
    "keywords": ["Sports"],
    "creator": ["The Hans India"],
    "description": "Indian Grandmaster R Praggnanandhaa defeated Russia's Vladislav Artemiev in the 15th and final round of the preliminary phase of the Airthings Masters, an online rapid chess tournament, but missed out on qualifying for the quarterfinals.",
    "full_description": "Indian Grandmaster R PraggnanandhaaIndian Grandmaster R PraggnanandhaaChennai: Indian Grandmaster R Praggnanandhaa defeated Russia's Vladislav Artemiev in the 15th and final round of the preliminary phase of the Airthings Masters, an online rapid chess tournament, but missed out on qualifying for the quarterfinals.The 16-year-old started the final day of the preliminary rounds with a draw against German Vincent Keymer in round 13 before going down to Hans Mokko Niemann (USA) in the next. His stirring win over world champion Magnus Carlsen in the eighth round caused a flutter but up-and-down performances pegged Praggnanandhaa back. He finished 11th in the standings with 19 points with the top eight going through to the knockout phase. A 32-move win over Keymer saw the teenaged Indian GM finish the event on a high. He scored five wins from 15 rounds, drew four games and lost six. The victories included those over Carlsen, top-10 player Lev Aronian, Russian Andrey Esipenko, former women's world champion Alexandra Kosteniuk and Keymer. Russia's Ian Nepomniachtchi topped the preliminary stage, racking up 29 points while Carlsen overcame a few defeats to finish second on 25 points, followed by Artemiev (24). Esipenko, Eric Hansen (Canada), Ding Liren and Liem Quang Le (both China) and Keymer rounded off the top eight. In the 16-player Airthings Masters, a player received three points for a win and one for a draw in the preliminary rounds. (PTI)",
    "pubDate": "2022-02-23 19:04:12",
    "image_url": "https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278488-chess.jpg",
    "country": ["india"],
    "category": ["sports"],
    "language": "english"
  },
  {
    "id": 2,
    "title": "Nike Shoes",
    "image": "../../assets/shoes2.png",
    "keywords": ["Business,Today NewsPaper"],
    "creator": ["The Hans India"],
    "description": "To safeguard investor interest and ensure that advertisements do not mislead or exploit consumers’ lack of expertise on crypto assets, Indian advertising industry’s self-governing body has come out with guidelines for virtual digital asset advertising.",
    "full_description": "ASCI releases ad guidelines for cryptosASCI releases ad guidelines for cryptosNew Delhi: To safeguard investor interest and ensure that advertisements do not mislead or exploit consumers' lack of expertise on crypto assets, Indian advertising industry's self-governing body has come out with guidelines for virtual digital asset advertising. The guidelines have been issued after consulting industry stakeholders, including the Union government. The Advertising Standards Council of India (ASCI) noted that even as the government continues to work on the framework for virtual digital assets (VDA), commonly referred to as crypto or non-fungible token (NFT) products, advertising for these products has been very aggressive over the past few months. \"ASCI noted that several of these advertisements do not adequately disclose the risks associated with such products,\" it said in a release. As per the guidelines, all virtual digital asset-related ads released on or after April 1 must carry the disclaimer, \"Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.\" The disclaimer will have to be carried in promotional content in print, video and audio mediums. In print or static, the disclaimer must be equal to at least 1/5th of the advertising space at the bottom of the advertisement in an easy to read font, against a plain background, and to the maximum font size afforded by the space. In audio, the disclaimer must be spoken at the end of the advertisement and the voiceover should be at a normal speaking pace and must not be hurried. The guidelines also cover social media posts. The advertising body has also barred advertisers to use words \"currency\", \"securities\", \"custodian\" and \"depositories\" in advertisements of VDA products or services as \"consumers associate these terms with regulated products\". Also, advertisements that provide information on the cost or profitability of VDA products must contain clear, accurate, sufficient and updated information.",
    "pubDate": "2022-02-23 19:03:49",
    "image_url": "https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278487-cryptos.jpg",
    "country": ["india"],
    "category": ["business"],
    "language": "english"
  },
  {
    "id": 3,
    "title": "Active Shoes",
    "image": "../../assets/shoes3.png",
    "keywords": null,
    "creator": ["North Shore News"],
    "description": "The existence of North Vancouver as we know it is probably just one legacy of slavery in Canada",
    "pubDate": "2022-02-23 19:03:46",
    "full_description": "We bring you a story this week revealing how the capital behind the early settlement of North Vancouver came from a family fortune amassed through the transatlantic slave trade . It is both illuminating and maddening. In Canada, we have a nasty habit of dismissing racism and discussions of slavery as American issues, not our own. We now know just how wrong that is. There are most likely other Canadian communities and institutions that are a legacy of slavery too, if only we know where to look. And the abolition of slavery has been followed by decades of both legal and social persecution. Wealth begat wealth. Exclusion begat exclusion. That is nature of systemic racism. Here on the North Shore, we have seen legal covenants barring people of colour from owning homes, and the abuse directed at the family of athletes and activists Harry and Valerie Jerome when their parents came to North Vancouver in 1951. These are very much our problems. We foresee already some folks in the community will take issue with this story. It’s “divisive” to dredge up racial injustices, they say – as if keeping them hidden is somehow nobler. The sooner we acknowledge our real history, the sooner we can have a more productive discussion about how to properly redress those injustices. We have an equally bad habit of failing to properly celebrate the achievements of Black people in Canada. As this Black History Month draws to its close, we urge everyone to acknowledge both – the struggle and the success. Only then can we start building a history to be proud of.",
    "image_url": "https://www.vmcdn.ca/f/files/nsnews/images/historic-images/guy-heywood-01-mw-web.jpg;w=960",
    "country": ["canada"],
    "category": ["top"],
    "language": "english"
  },
  {
    "id": 4,
    "title": "‘Shoes",
    "image": "../../assets/shoes4.png",
    "keywords": ["Netflix", "Ozark"],
    "creator": ["Whitney Danhauer"],
    "description": "Fans only have a few more weeks to go before they can watch the conclusion of Netflix original 'Ozark.' Here's everything you need to know.",
    "full_description": "The wait is almost over. Netflix just announced an official release date for Ozark Season 4 Part 2, and it’s much closer than most people realized. On top of that, Netflix released a short teaser trailer for the second half of the season. Here’s everything you need to know about the upcoming conclusion to the Byrde family’s criminal endeavors. [Warning: This article contains spoilers for Ozark Season 4 Part 1.] ‘Ozark’ Season 4 | Cr. Netflix ‘Ozark’ Season 4 Part 2 picks up right after the shocking end of part 1 When we last left the folks in Ozark Season 4, things were not looking good for Wendy (Laura Linney) and Marty Byrde (Jason Bateman). Their deal with the FBI went sour. Also, their FBI contact, Maya (Jessica Francis Dukes,) arrested Mexican cartel leader Omar Navarro (Felix Solis). His nephew, Javi (Alfonso Herrera,) believes the Byrdes were behind the arrest. Plus, when the CEO of the pharmaceutical company chose to buy Darlene Snell’s (Lisa Emery) heroin instead of the Navarro cartel’s heroine, Javi decided to get revenge by killing both Darlene and her new husband, Wyatt (Charlie Tahan). One of the last scenes showed Ruth Langmore (Julia Garner) discovering Wyatt’s dead body. This sent Ruth into a hysterical rage. She didn’t care that the Mexican cartel was behind the murders, and she took off with baby Zeke and a shotgun in her lap. Netflix’s official synopsis for the conclusion of the series reads, ​​” Marty and Wendy are rid of Helen and climb to the top of Navarro’s empire. They find another opportunity to get out of the Ozarks but some past sins won’t stay buried and the most dangerous threats come from blood.” The end is near. Ozark's final episodes premiere April 29. pic.twitter.com/WWBPFmlXlY— Netflix (@netflix) February 23, 2022 RELATED: ‘Ozark’: Wyatt Actor Reacts to That Shocking Moment in Season 4 Episode 7 ‘Ozark’ Season 4 Part 2 arrives on April 29, 2022 The death of Ruth’s cousin, Wyatt, set up the final seven episodes in Ozark Season 4 Part 2. Ruth’s plan to go up against the cartel is essentially a death sentence. However, because Wyatt was one of the people she loved most in life, she doesn’t seem to care. The Byrdes were almost free from their dangerous life of money laundering and drug deals, and it couldn’t come at a better time. Jonah (Skyler Gaertner,) their son, recently started laundering money for Darlene, and Wendy was desperate to get him away. However, there’s still the issue of Jonah’s anger at his mother for ordering the murder of his beloved Uncle Ben. Netflix News: Part II of #Ozark's final season will drop on April 29. pic.twitter.com/CZhmpxyVqo— Brandon Katz (@Great_Katzby) February 23, 2022 Several questions still need answers in the final episodes Following the plot of Ozark might make audiences’ heads spin. Now that the show is in the home stretch, there are only a few questions left that need answers. During the opening scene of Ozark Season 4 Part 1, fans watched as the Byrdes appeared to leave their life of crime behind them. However, the van they’re driving in soon crashes, and folks wondered if anyone in the family survived the wreck. Was the car crash a dream? Were viewers watching some version of the future? The goat urn Ruth chose to store Ben’s ashes seemed to be an odd focal point in Ozark Season 4 Part 1. Will fans eventually understand the meaning behind the urn? Did Ben really die? The teaser trailer focuses on Ruth. This hints that fans will most likely learn the truth about Ben’s death and the meaning behind the urn. Only seven episodes remain, and several loose ends need to be tied up. Thankfully, April 29, 2022, is only a few weeks away. Stream previous episodes of Ozark exclusively on Netflix. RELATED: ‘Ozark’ Boss Says [Spoiler] Wasn’t Originally Supposed to Die: ‘That Was Really Hard’ Read the original article from The Cheat Sheet",
    "pubDate": "2022-02-23 19:03:19",
    "image_url": null,
    "country": ["united states of america"],
    "category": ["entertainment"],
    "language": "english"
  },
  {
    "id": 5,
    "title": "Adidas Shoes",
    "image": "../../assets/shoes1.png",
    "keywords": ["Sports"],
    "creator": ["The Hans India"],
    "description": "Indian Grandmaster R Praggnanandhaa defeated Russia's Vladislav Artemiev in the 15th and final round of the preliminary phase of the Airthings Masters, an online rapid chess tournament, but missed out on qualifying for the quarterfinals.",
    "full_description": "Indian Grandmaster R PraggnanandhaaIndian Grandmaster R PraggnanandhaaChennai: Indian Grandmaster R Praggnanandhaa defeated Russia's Vladislav Artemiev in the 15th and final round of the preliminary phase of the Airthings Masters, an online rapid chess tournament, but missed out on qualifying for the quarterfinals.The 16-year-old started the final day of the preliminary rounds with a draw against German Vincent Keymer in round 13 before going down to Hans Mokko Niemann (USA) in the next. His stirring win over world champion Magnus Carlsen in the eighth round caused a flutter but up-and-down performances pegged Praggnanandhaa back. He finished 11th in the standings with 19 points with the top eight going through to the knockout phase. A 32-move win over Keymer saw the teenaged Indian GM finish the event on a high. He scored five wins from 15 rounds, drew four games and lost six. The victories included those over Carlsen, top-10 player Lev Aronian, Russian Andrey Esipenko, former women's world champion Alexandra Kosteniuk and Keymer. Russia's Ian Nepomniachtchi topped the preliminary stage, racking up 29 points while Carlsen overcame a few defeats to finish second on 25 points, followed by Artemiev (24). Esipenko, Eric Hansen (Canada), Ding Liren and Liem Quang Le (both China) and Keymer rounded off the top eight. In the 16-player Airthings Masters, a player received three points for a win and one for a draw in the preliminary rounds. (PTI)",
    "pubDate": "2022-02-23 19:04:12",
    "image_url": "https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278488-chess.jpg",
    "country": ["india"],
    "category": ["sports"],
    "language": "english"
  },
  {
    "id": 6,
    "title": "Nike Shoes",
    "image": "../../assets/shoes2.png",
    "keywords": ["Business,Today NewsPaper"],
    "creator": ["The Hans India"],
    "description": "To safeguard investor interest and ensure that advertisements do not mislead or exploit consumers’ lack of expertise on crypto assets, Indian advertising industry’s self-governing body has come out with guidelines for virtual digital asset advertising.",
    "full_description": "ASCI releases ad guidelines for cryptosASCI releases ad guidelines for cryptosNew Delhi: To safeguard investor interest and ensure that advertisements do not mislead or exploit consumers' lack of expertise on crypto assets, Indian advertising industry's self-governing body has come out with guidelines for virtual digital asset advertising. The guidelines have been issued after consulting industry stakeholders, including the Union government. The Advertising Standards Council of India (ASCI) noted that even as the government continues to work on the framework for virtual digital assets (VDA), commonly referred to as crypto or non-fungible token (NFT) products, advertising for these products has been very aggressive over the past few months. \"ASCI noted that several of these advertisements do not adequately disclose the risks associated with such products,\" it said in a release. As per the guidelines, all virtual digital asset-related ads released on or after April 1 must carry the disclaimer, \"Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.\" The disclaimer will have to be carried in promotional content in print, video and audio mediums. In print or static, the disclaimer must be equal to at least 1/5th of the advertising space at the bottom of the advertisement in an easy to read font, against a plain background, and to the maximum font size afforded by the space. In audio, the disclaimer must be spoken at the end of the advertisement and the voiceover should be at a normal speaking pace and must not be hurried. The guidelines also cover social media posts. The advertising body has also barred advertisers to use words \"currency\", \"securities\", \"custodian\" and \"depositories\" in advertisements of VDA products or services as \"consumers associate these terms with regulated products\". Also, advertisements that provide information on the cost or profitability of VDA products must contain clear, accurate, sufficient and updated information.",
    "pubDate": "2022-02-23 19:03:49",
    "image_url": "https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278487-cryptos.jpg",
    "country": ["india"],
    "category": ["business"],
    "language": "english"
  },
  {
    "id": 7,
    "title": "Active Shoes",
    "image": "../../assets/shoes3.png",
    "keywords": null,
    "creator": ["North Shore News"],
    "description": "The existence of North Vancouver as we know it is probably just one legacy of slavery in Canada",
    "pubDate": "2022-02-23 19:03:46",
    "full_description": "We bring you a story this week revealing how the capital behind the early settlement of North Vancouver came from a family fortune amassed through the transatlantic slave trade . It is both illuminating and maddening. In Canada, we have a nasty habit of dismissing racism and discussions of slavery as American issues, not our own. We now know just how wrong that is. There are most likely other Canadian communities and institutions that are a legacy of slavery too, if only we know where to look. And the abolition of slavery has been followed by decades of both legal and social persecution. Wealth begat wealth. Exclusion begat exclusion. That is nature of systemic racism. Here on the North Shore, we have seen legal covenants barring people of colour from owning homes, and the abuse directed at the family of athletes and activists Harry and Valerie Jerome when their parents came to North Vancouver in 1951. These are very much our problems. We foresee already some folks in the community will take issue with this story. It’s “divisive” to dredge up racial injustices, they say – as if keeping them hidden is somehow nobler. The sooner we acknowledge our real history, the sooner we can have a more productive discussion about how to properly redress those injustices. We have an equally bad habit of failing to properly celebrate the achievements of Black people in Canada. As this Black History Month draws to its close, we urge everyone to acknowledge both – the struggle and the success. Only then can we start building a history to be proud of.",
    "image_url": "https://www.vmcdn.ca/f/files/nsnews/images/historic-images/guy-heywood-01-mw-web.jpg;w=960",
    "country": ["canada"],
    "category": ["top"],
    "language": "english"
  },
  {
    "id": 8,
    "title": "‘Shoes",
    "image": "../../assets/shoes4.png",
    "keywords": ["Netflix", "Ozark"],
    "creator": ["Whitney Danhauer"],
    "description": "Fans only have a few more weeks to go before they can watch the conclusion of Netflix original 'Ozark.' Here's everything you need to know.",
    "full_description": "The wait is almost over. Netflix just announced an official release date for Ozark Season 4 Part 2, and it’s much closer than most people realized. On top of that, Netflix released a short teaser trailer for the second half of the season. Here’s everything you need to know about the upcoming conclusion to the Byrde family’s criminal endeavors. [Warning: This article contains spoilers for Ozark Season 4 Part 1.] ‘Ozark’ Season 4 | Cr. Netflix ‘Ozark’ Season 4 Part 2 picks up right after the shocking end of part 1 When we last left the folks in Ozark Season 4, things were not looking good for Wendy (Laura Linney) and Marty Byrde (Jason Bateman). Their deal with the FBI went sour. Also, their FBI contact, Maya (Jessica Francis Dukes,) arrested Mexican cartel leader Omar Navarro (Felix Solis). His nephew, Javi (Alfonso Herrera,) believes the Byrdes were behind the arrest. Plus, when the CEO of the pharmaceutical company chose to buy Darlene Snell’s (Lisa Emery) heroin instead of the Navarro cartel’s heroine, Javi decided to get revenge by killing both Darlene and her new husband, Wyatt (Charlie Tahan). One of the last scenes showed Ruth Langmore (Julia Garner) discovering Wyatt’s dead body. This sent Ruth into a hysterical rage. She didn’t care that the Mexican cartel was behind the murders, and she took off with baby Zeke and a shotgun in her lap. Netflix’s official synopsis for the conclusion of the series reads, ​​” Marty and Wendy are rid of Helen and climb to the top of Navarro’s empire. They find another opportunity to get out of the Ozarks but some past sins won’t stay buried and the most dangerous threats come from blood.” The end is near. Ozark's final episodes premiere April 29. pic.twitter.com/WWBPFmlXlY— Netflix (@netflix) February 23, 2022 RELATED: ‘Ozark’: Wyatt Actor Reacts to That Shocking Moment in Season 4 Episode 7 ‘Ozark’ Season 4 Part 2 arrives on April 29, 2022 The death of Ruth’s cousin, Wyatt, set up the final seven episodes in Ozark Season 4 Part 2. Ruth’s plan to go up against the cartel is essentially a death sentence. However, because Wyatt was one of the people she loved most in life, she doesn’t seem to care. The Byrdes were almost free from their dangerous life of money laundering and drug deals, and it couldn’t come at a better time. Jonah (Skyler Gaertner,) their son, recently started laundering money for Darlene, and Wendy was desperate to get him away. However, there’s still the issue of Jonah’s anger at his mother for ordering the murder of his beloved Uncle Ben. Netflix News: Part II of #Ozark's final season will drop on April 29. pic.twitter.com/CZhmpxyVqo— Brandon Katz (@Great_Katzby) February 23, 2022 Several questions still need answers in the final episodes Following the plot of Ozark might make audiences’ heads spin. Now that the show is in the home stretch, there are only a few questions left that need answers. During the opening scene of Ozark Season 4 Part 1, fans watched as the Byrdes appeared to leave their life of crime behind them. However, the van they’re driving in soon crashes, and folks wondered if anyone in the family survived the wreck. Was the car crash a dream? Were viewers watching some version of the future? The goat urn Ruth chose to store Ben’s ashes seemed to be an odd focal point in Ozark Season 4 Part 1. Will fans eventually understand the meaning behind the urn? Did Ben really die? The teaser trailer focuses on Ruth. This hints that fans will most likely learn the truth about Ben’s death and the meaning behind the urn. Only seven episodes remain, and several loose ends need to be tied up. Thankfully, April 29, 2022, is only a few weeks away. Stream previous episodes of Ozark exclusively on Netflix. RELATED: ‘Ozark’ Boss Says [Spoiler] Wasn’t Originally Supposed to Die: ‘That Was Really Hard’ Read the original article from The Cheat Sheet",
    "pubDate": "2022-02-23 19:03:19",
    "image_url": null,
    "country": ["united states of america"],
    "category": ["entertainment"],
    "language": "english"
  },
  {
    "id": 9,
    "title": "Adidas Shoes",
    "image": "../../assets/shoes1.png",
    "keywords": ["Sports"],
    "creator": ["The Hans India"],
    "description": "Indian Grandmaster R Praggnanandhaa defeated Russia's Vladislav Artemiev in the 15th and final round of the preliminary phase of the Airthings Masters, an online rapid chess tournament, but missed out on qualifying for the quarterfinals.",
    "full_description": "Indian Grandmaster R PraggnanandhaaIndian Grandmaster R PraggnanandhaaChennai: Indian Grandmaster R Praggnanandhaa defeated Russia's Vladislav Artemiev in the 15th and final round of the preliminary phase of the Airthings Masters, an online rapid chess tournament, but missed out on qualifying for the quarterfinals.The 16-year-old started the final day of the preliminary rounds with a draw against German Vincent Keymer in round 13 before going down to Hans Mokko Niemann (USA) in the next. His stirring win over world champion Magnus Carlsen in the eighth round caused a flutter but up-and-down performances pegged Praggnanandhaa back. He finished 11th in the standings with 19 points with the top eight going through to the knockout phase. A 32-move win over Keymer saw the teenaged Indian GM finish the event on a high. He scored five wins from 15 rounds, drew four games and lost six. The victories included those over Carlsen, top-10 player Lev Aronian, Russian Andrey Esipenko, former women's world champion Alexandra Kosteniuk and Keymer. Russia's Ian Nepomniachtchi topped the preliminary stage, racking up 29 points while Carlsen overcame a few defeats to finish second on 25 points, followed by Artemiev (24). Esipenko, Eric Hansen (Canada), Ding Liren and Liem Quang Le (both China) and Keymer rounded off the top eight. In the 16-player Airthings Masters, a player received three points for a win and one for a draw in the preliminary rounds. (PTI)",
    "pubDate": "2022-02-23 19:04:12",
    "image_url": "https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278488-chess.jpg",
    "country": ["india"],
    "category": ["sports"],
    "language": "english"
  },
  {
    "id": 10,
    "title": "Nike Shoes",
    "image": "../../assets/shoes2.png",
    "keywords": ["Business,Today NewsPaper"],
    "creator": ["The Hans India"],
    "description": "To safeguard investor interest and ensure that advertisements do not mislead or exploit consumers’ lack of expertise on crypto assets, Indian advertising industry’s self-governing body has come out with guidelines for virtual digital asset advertising.",
    "full_description": "ASCI releases ad guidelines for cryptosASCI releases ad guidelines for cryptosNew Delhi: To safeguard investor interest and ensure that advertisements do not mislead or exploit consumers' lack of expertise on crypto assets, Indian advertising industry's self-governing body has come out with guidelines for virtual digital asset advertising. The guidelines have been issued after consulting industry stakeholders, including the Union government. The Advertising Standards Council of India (ASCI) noted that even as the government continues to work on the framework for virtual digital assets (VDA), commonly referred to as crypto or non-fungible token (NFT) products, advertising for these products has been very aggressive over the past few months. \"ASCI noted that several of these advertisements do not adequately disclose the risks associated with such products,\" it said in a release. As per the guidelines, all virtual digital asset-related ads released on or after April 1 must carry the disclaimer, \"Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.\" The disclaimer will have to be carried in promotional content in print, video and audio mediums. In print or static, the disclaimer must be equal to at least 1/5th of the advertising space at the bottom of the advertisement in an easy to read font, against a plain background, and to the maximum font size afforded by the space. In audio, the disclaimer must be spoken at the end of the advertisement and the voiceover should be at a normal speaking pace and must not be hurried. The guidelines also cover social media posts. The advertising body has also barred advertisers to use words \"currency\", \"securities\", \"custodian\" and \"depositories\" in advertisements of VDA products or services as \"consumers associate these terms with regulated products\". Also, advertisements that provide information on the cost or profitability of VDA products must contain clear, accurate, sufficient and updated information.",
    "pubDate": "2022-02-23 19:03:49",
    "image_url": "https://assets.thehansindia.com/h-upload/2022/02/23/500x300_1278487-cryptos.jpg",
    "country": ["india"],
    "category": ["business"],
    "language": "english"
  },
  {
    "id": 11,
    "title": "Active Shoes",
    "image": "../../assets/shoes3.png",
    "keywords": null,
    "creator": ["North Shore News"],
    "description": "The existence of North Vancouver as we know it is probably just one legacy of slavery in Canada",
    "pubDate": "2022-02-23 19:03:46",
    "full_description": "We bring you a story this week revealing how the capital behind the early settlement of North Vancouver came from a family fortune amassed through the transatlantic slave trade . It is both illuminating and maddening. In Canada, we have a nasty habit of dismissing racism and discussions of slavery as American issues, not our own. We now know just how wrong that is. There are most likely other Canadian communities and institutions that are a legacy of slavery too, if only we know where to look. And the abolition of slavery has been followed by decades of both legal and social persecution. Wealth begat wealth. Exclusion begat exclusion. That is nature of systemic racism. Here on the North Shore, we have seen legal covenants barring people of colour from owning homes, and the abuse directed at the family of athletes and activists Harry and Valerie Jerome when their parents came to North Vancouver in 1951. These are very much our problems. We foresee already some folks in the community will take issue with this story. It’s “divisive” to dredge up racial injustices, they say – as if keeping them hidden is somehow nobler. The sooner we acknowledge our real history, the sooner we can have a more productive discussion about how to properly redress those injustices. We have an equally bad habit of failing to properly celebrate the achievements of Black people in Canada. As this Black History Month draws to its close, we urge everyone to acknowledge both – the struggle and the success. Only then can we start building a history to be proud of.",
    "image_url": "https://www.vmcdn.ca/f/files/nsnews/images/historic-images/guy-heywood-01-mw-web.jpg;w=960",
    "country": ["canada"],
    "category": ["top"],
    "language": "english"
  },
  {
    "id": 12,
    "title": "‘Shoes",
    "image": "../../assets/shoes4.png",
    "keywords": ["Netflix", "Ozark"],
    "creator": ["Whitney Danhauer"],
    "description": "Fans only have a few more weeks to go before they can watch the conclusion of Netflix original 'Ozark.' Here's everything you need to know.",
    "full_description": "The wait is almost over. Netflix just announced an official release date for Ozark Season 4 Part 2, and it’s much closer than most people realized. On top of that, Netflix released a short teaser trailer for the second half of the season. Here’s everything you need to know about the upcoming conclusion to the Byrde family’s criminal endeavors. [Warning: This article contains spoilers for Ozark Season 4 Part 1.] ‘Ozark’ Season 4 | Cr. Netflix ‘Ozark’ Season 4 Part 2 picks up right after the shocking end of part 1 When we last left the folks in Ozark Season 4, things were not looking good for Wendy (Laura Linney) and Marty Byrde (Jason Bateman). Their deal with the FBI went sour. Also, their FBI contact, Maya (Jessica Francis Dukes,) arrested Mexican cartel leader Omar Navarro (Felix Solis). His nephew, Javi (Alfonso Herrera,) believes the Byrdes were behind the arrest. Plus, when the CEO of the pharmaceutical company chose to buy Darlene Snell’s (Lisa Emery) heroin instead of the Navarro cartel’s heroine, Javi decided to get revenge by killing both Darlene and her new husband, Wyatt (Charlie Tahan). One of the last scenes showed Ruth Langmore (Julia Garner) discovering Wyatt’s dead body. This sent Ruth into a hysterical rage. She didn’t care that the Mexican cartel was behind the murders, and she took off with baby Zeke and a shotgun in her lap. Netflix’s official synopsis for the conclusion of the series reads, ​​” Marty and Wendy are rid of Helen and climb to the top of Navarro’s empire. They find another opportunity to get out of the Ozarks but some past sins won’t stay buried and the most dangerous threats come from blood.” The end is near. Ozark's final episodes premiere April 29. pic.twitter.com/WWBPFmlXlY— Netflix (@netflix) February 23, 2022 RELATED: ‘Ozark’: Wyatt Actor Reacts to That Shocking Moment in Season 4 Episode 7 ‘Ozark’ Season 4 Part 2 arrives on April 29, 2022 The death of Ruth’s cousin, Wyatt, set up the final seven episodes in Ozark Season 4 Part 2. Ruth’s plan to go up against the cartel is essentially a death sentence. However, because Wyatt was one of the people she loved most in life, she doesn’t seem to care. The Byrdes were almost free from their dangerous life of money laundering and drug deals, and it couldn’t come at a better time. Jonah (Skyler Gaertner,) their son, recently started laundering money for Darlene, and Wendy was desperate to get him away. However, there’s still the issue of Jonah’s anger at his mother for ordering the murder of his beloved Uncle Ben. Netflix News: Part II of #Ozark's final season will drop on April 29. pic.twitter.com/CZhmpxyVqo— Brandon Katz (@Great_Katzby) February 23, 2022 Several questions still need answers in the final episodes Following the plot of Ozark might make audiences’ heads spin. Now that the show is in the home stretch, there are only a few questions left that need answers. During the opening scene of Ozark Season 4 Part 1, fans watched as the Byrdes appeared to leave their life of crime behind them. However, the van they’re driving in soon crashes, and folks wondered if anyone in the family survived the wreck. Was the car crash a dream? Were viewers watching some version of the future? The goat urn Ruth chose to store Ben’s ashes seemed to be an odd focal point in Ozark Season 4 Part 1. Will fans eventually understand the meaning behind the urn? Did Ben really die? The teaser trailer focuses on Ruth. This hints that fans will most likely learn the truth about Ben’s death and the meaning behind the urn. Only seven episodes remain, and several loose ends need to be tied up. Thankfully, April 29, 2022, is only a few weeks away. Stream previous episodes of Ozark exclusively on Netflix. RELATED: ‘Ozark’ Boss Says [Spoiler] Wasn’t Originally Supposed to Die: ‘That Was Really Hard’ Read the original article from The Cheat Sheet",
    "pubDate": "2022-02-23 19:03:19",
    "image_url": null,
    "country": ["united states of america"],
    "category": ["entertainment"],
    "language": "english"
  }
]
